/* Word 'Cancel' */
"Cancel" = "Cancel";

/* Err msg: Config file encoding problem */
"Cfg encoding err" = "The configuration file’s encoding could not be detected. Please make sure that the file has a common encoding such as UTF-8, UTF-16, MacRoman or Latin1.";

/* Error msg: An image has no 'path' attribute */
"Cfg image no path type" = "Image “%@” has no “path” attribute.";

/* Error msg: Invalid element type */
"Cfg invalid type" = "Unknown type “%@” for element “%@”";

/* Error msg: Missing 'default' or 'text' attributes */
"Cfg lacks default or text" = "Element “%@” has none of the attributes “default” or “text”. One of these attributes (which are synonyms) must be set.";

/* Error msg: Missing 'label' attribute */
"Cfg lacks label" = "You have to set the “label” attribute for element “%@”.";

/* Error msg: Missing 'option' attributes */
"Cfg lacks options" = "Element “%@” needs at least one “option” attribute.";

/* Err msg: Missing 'type' attribute */
"Cfg lacks type" = "Configuration error: Element “%1$@” lacks a type attribute. In other words: you have to add a line like the following one:\n\n%1$@.type = textfield";

/* Error msg: x and y attributes both must be provided */
"Cfg lacks x or y" = "Element “%@”:When using absolute positioning, you have to supply “x” AND “y” attributes.";

/* Err msg: Config file has no elements */
"Cfg no elements" = "The configuration you specified does not contain any elements.\n\nPlease take a look at Pashua's documentation or the examples included with it.";

/* Err msg: Config file path does not exist */
"Cfg path invalid" = "The path to the configuration file is invalid.";

"Cfg path missing" = "*.title = Welcome to Pashua\nimg.x = 65\nimg.y = 37\nimg.type = image\nimg.maxwidth = 250\nimg.path = %@\ninfo.x = 0\ninfo.y = 60\ninfo.type = text\ninfo.width = 350\ninfo.default = It looks like you have launched Pashua by doubleclicking the application icon. This is not how Pashua is supposed to be used.[return][return]As Pashua only provides a user interface for other scripts/applications, you will usually not launch it directly, but instead write a script in a programming language of your choice, which passes a definition of a user interface to Pashua, which will then use the definition to display the user interface.[return][return]Please consult the documentation for more information, which you can access from the “Help” menu.";

/* Err msg: Config file path is not readable */
"Cfg path noread" = "The configuration file passed to Pashua does exist, but it is not readable.";

/* Error msg: Attr. 'rely' is too large */
"Cfg rely too small" = "Element “%@”: The value for “rely” is smaller than the allowed minimum.";

/* Err msg: Don't know what to do with this line */
"Cfg strange line" = "The following line is neither a comment, nor does it contain a valid command:\n\n%@\n";

/* Error msg: */
"Cfg vibrant invalid" = "Configuration error: vibrant appearance can not be combined with transparency.";

/* Word 'Choose' */
"Choose" = "Choose";

/* Word 'Choose...' */
"Choose..." = "Choose…";

/* Error msg: Invalid / unknown encoding */
"Encoding argument invalid" = "The encoding “%@” you passed as argument to Pashua is invalid. Please refer to the documentation to find out which encodings are supported.";

/* Word 'Error' */
"Error" = "Error";

/* Error msg: Image path is invalid */
"Image path is invalid" = "The image path is invalid.";

/* Button title for default button */
"OK" = "OK";

"Clear" = "Clear";

"Position attributes conflict" = "You cannot use “x”/“y” and “autosavekey” at the same time.";
